Revit 2015 API
ViewCropRegionShapeManager Members
The ViewCropRegionShapeManager type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ViewCropRegionShapeManager
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCropRegionShape
 Gets the crop region boundaries.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCropRegionShapeValid
 Verifies that boundaries represent one closed curve loop without self-intersections, consisting of non-zero length straight lines in plane parallel to the view plane. Curves in boundaries use model coordinates.
RemoveCropRegionShape
 Removes boundaries of crop region.
RemoveSplit
 Removes split settings of crop region.
SetCropRegionEmptyShape
 Sets crop region of empty shape making possible interactive sketching.
SetCropRegionShape
 Sets boundaries of crop region.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ShapeSet
 Verifies that view has crop region shape set.
Split
 Verifies that view crop region is split.
Valid
 Verifies that view is allowed to manage crop region shape.
See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace